

--task 1
select "Н_ЛЮДИ"."ИД", "Н_ВЕДОМОСТИ"."ДАТА" from "Н_ЛЮДИ"
                                                    LEFT JOIN "Н_ВЕДОМОСТИ" on "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
WHERE "Н_ЛЮДИ"."ИД" = 142095
  AND "Н_ВЕДОМОСТИ"."ДАТА" = '2010-06-18'
  AND "Н_ВЕДОМОСТИ"."ДАТА" > '2022-06-08';

--
--task 2
SELECT "Н_ЛЮДИ"."ОТЧЕСТВО", "Н_ВЕДОМОСТИ"."ДАТА", "Н_СЕССИЯ"."ДАТА" FROM "Н_ЛЮДИ"
                                                                             LEFT JOIN "Н_ВЕДОМОСТИ" on "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
                                                                             LEFT JOIN "Н_СЕССИЯ" on "Н_СЕССИЯ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
WHERE "Н_ЛЮДИ"."ФАМИЛИЯ" > 'Афанасьев' AND "Н_ВЕДОМОСТИ"."ИД" < 1250981;


--
--task 3
SELECT count(*) FROM "Н_УЧЕНИКИ"
                         JOIN "Н_ПЛАНЫ" ON "Н_ПЛАНЫ"."ИД" = "Н_УЧЕНИКИ"."ПЛАН_ИД"
                         JOIN "Н_ЛЮДИ" on "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
                         JOIN "Н_ФОРМЫ_ОБУЧЕНИЯ" ON "Н_ПЛАНЫ"."ФО_ИД" = "Н_ФОРМЫ_ОБУЧЕНИЯ"."ИД"
WHERE "Н_ФОРМЫ_ОБУЧЕНИЯ"."НАИМЕНОВАНИЕ" = 'Очно-заочная(вечерняя)' AND extract(YEAR from age("Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ"))::INT < 20;

--
--task 4
SELECT "Н_ЛЮДИ"."ОТЧЕСТВО", COUNT("Н_ЛЮДИ"."ОТЧЕСТВО") AS "Кол-во" FROM
    "Н_ЛЮДИ"
WHERE "Н_ЛЮДИ"."ОТЧЕСТВО" IN (
    SELECT "Н_ЛЮДИ"."ОТЧЕСТВО" FROM "Н_ЛЮДИ"
                                        JOIN "Н_ОБУЧЕНИЯ" ON "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
                                        JOIN "Н_УЧЕНИКИ" USING ("ВИД_ОБУЧ_ИД", "ЧЛВК_ИД")
                                        JOIN "Н_ПЛАНЫ" ON "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
                                        JOIN "Н_ФОРМЫ_ОБУЧЕНИЯ" ON "Н_ПЛАНЫ"."ФО_ИД" = "Н_ФОРМЫ_ОБУЧЕНИЯ"."ИД"
                                        JOIN "Н_ОТДЕЛЫ" on "Н_ПЛАНЫ"."ОТД_ИД" = "Н_ОТДЕЛЫ"."ИД"
    WHERE "Н_ОТДЕЛЫ"."КОРОТКОЕ_ИМЯ" = 'КТиУ'
    GROUP BY "Н_ЛЮДИ"."ОТЧЕСТВО"
    HAVING COUNT("Н_ЛЮДИ"."ОТЧЕСТВО") < 10
)
GROUP BY "Н_ЛЮДИ"."ОТЧЕСТВО";

--task 5
SELECT "Н_УЧЕНИКИ"."ГРУППА", AVG(EXTRACT(YEAR from AGE("Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ"))::NUMERIC) AS av_age
FROM "Н_УЧЕНИКИ"
         JOIN "Н_ЛЮДИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
GROUP BY "Н_УЧЕНИКИ"."ГРУППА"
HAVING AVG(EXTRACT(YEAR FROM AGE("Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ"))::NUMERIC) >
       (SELECT MIN(EXTRACT(YEAR FROM AGE("Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ")))
        FROM "Н_ЛЮДИ"
                 JOIN "Н_УЧЕНИКИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД" AND "Н_УЧЕНИКИ"."ГРУППА" = '3100');



--task 6
SELECT
    Н_УЧЕНИКИ.ГРУППА,
    "Н_ЛЮДИ"."ИД", "Н_ЛЮДИ"."ФАМИЛИЯ", "Н_ЛЮДИ"."ИМЯ", "Н_ЛЮДИ"."ОТЧЕСТВО",
    Н_УЧЕНИКИ.П_ПРКОК_ИД
FROM Н_УЧЕНИКИ
         JOIN "Н_ЛЮДИ" on Н_УЧЕНИКИ.ЧЛВК_ИД = "Н_ЛЮДИ"."ИД"
WHERE Н_УЧЕНИКИ.ПЛАН_ИД IN
      (
          SELECT "ПЛАН_ИД" from "Н_ПЛАНЫ"
          WHERE EXISTS
              (
                  SELECT Н_ФОРМЫ_ОБУЧЕНИЯ.ИД FROM Н_ФОРМЫ_ОБУЧЕНИЯ
                  where Н_ФОРМЫ_ОБУЧЕНИЯ.НАИМЕНОВАНИЕ = 'Очная' or Н_ФОРМЫ_ОБУЧЕНИЯ.НАИМЕНОВАНИЕ = 'Заочная'
              ) and
                  "ФО_ИД" IN
                  (
                      SELECT Н_ФОРМЫ_ОБУЧЕНИЯ.ИД FROM Н_ФОРМЫ_ОБУЧЕНИЯ
                      where Н_ФОРМЫ_ОБУЧЕНИЯ.НАИМЕНОВАНИЕ = 'Очная' or Н_ФОРМЫ_ОБУЧЕНИЯ.НАИМЕНОВАНИЕ = 'Заочная'
                  )
      )
  AND Н_УЧЕНИКИ.КОНЕЦ < '2012-09-01';


--task 7
SELECT ЛЮДИ.ИМЯ, ЛЮДИ.ФАМИЛИЯ, ЛЮДИ.ДАТА_РОЖДЕНИЯ
FROM Н_ЛЮДИ AS ЛЮДИ WHERE EXISTS (
    SELECT 1 FROM Н_УЧЕНИКИ
                      JOIN Н_ЛЮДИ ON Н_ЛЮДИ.ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
    WHERE Н_ЛЮДИ.ИМЯ = ЛЮДИ.ИМЯ AND
            Н_ЛЮДИ.ДАТА_РОЖДЕНИЯ != ЛЮДИ.ДАТА_РОЖДЕНИЯ AND
            Н_ЛЮДИ.ИД != ЛЮДИ.ИД
) ORDER BY ЛЮДИ.ИМЯ;


select DISTINCT  "Н_ДИСЦИПЛИНЫ"."НАИМЕНОВАНИЕ" from "Н_ДИСЦИПЛИНЫ"
 JOIN "Н_СТРОКИ_ПЛАНОВ" ON "Н_ДИСЦИПЛИНЫ"."ИД" = "Н_СТРОКИ_ПЛАНОВ"."ДИС_ИД"
 JOIN "Н_ЭЛЕМЕНТЫ_СТРОК" ON "Н_СТРОКИ_ПЛАНОВ"."ИД" = "Н_ЭЛЕМЕНТЫ_СТРОК"."СПЛ_ИД"
 JOIN "Н_СОДЕРЖАНИЯ_ЭЛЕМЕНТОВ_СТРОК" ON "Н_ЭЛЕМЕНТЫ_СТРОК"."ИД" = "Н_СОДЕРЖАНИЯ_ЭЛЕМЕНТОВ_СТРОК"."ЭСТ_ИД"
 JOIN "Н_СЕССИЯ" ON "Н_СОДЕРЖАНИЯ_ЭЛЕМЕНТОВ_СТРОК"."ИД" = "Н_СЕССИЯ"."СЭС_ИД"
                                               WHERE "Н_СЕССИЯ"."АУДИТОРИЯ" = '466';